{
  "backend/main.mo": "Main Motoko actor implementing the medical imaging backend with user profile management, CT scan upload/retrieval, external API configuration, and role-based access control via admin/user permissions.",
  "backend/migration.mo": "Defines a no-op state migration module that accepts the old actor state and returns an empty new actor state.",
  "feature_evidence.json": "Feature evidence report mapping two API Configuration UI features (admin button in Header and dialog form contents) to their relevant source files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, serving as a reference for the frontend codebase structure.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "HTML entry point for the React application, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that manages authentication state, profile loading, and conditionally renders LoginScreen, ProfileSetup, or the main Dashboard layout with Header and Footer.",
  "frontend/src/components/ApiConfigDialog.tsx": "Admin-only modal dialog for configuring the external AI API, featuring pre-filled endpoint URL and masked API key inputs, per-field validation, and save/cancel actions backed by React Query mutations.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying a dynamic copyright year and a medical disclaimer note.",
  "frontend/src/components/Header.tsx": "Application header showing the MediScan AI brand, user profile info, a logout button, and an API Config button visible only to admin users with a loading indicator during the admin permission check.",
  "frontend/src/components/LoginScreen.tsx": "Renders the MediScan AI login page with feature highlights (AI analysis, fast results, secure storage) and an Internet Identity login button that handles authentication state.",
  "frontend/src/components/ProfileSetup.tsx": "Displays a form for new users to enter their name, department, and specialization, saving the profile via the `useSaveCallerUserProfile` mutation before proceeding.",
  "frontend/src/components/ScanCard.tsx": "Renders a clickable card for a single CT scan showing a thumbnail image, scan ID, patient ID, and an analyzed/pending badge with tumor detection status.",
  "frontend/src/components/ScanDetailDialog.tsx": "A modal dialog that shows full CT scan details including original and mask images in tabs, tumor stage/analysis results, and a button to trigger AI analysis if the external API is configured.",
  "frontend/src/components/ScansListTab.tsx": "Fetches and displays all CT scans as a grid of `ScanCard` components, with empty-state and loading states, and opens a `ScanDetailDialog` when a card is clicked.",
  "frontend/src/components/UploadScanTab.tsx": "Provides a form to upload a CT scan image with a patient ID, shows a live preview, and submits the file as a Uint8Array via the `useUploadScan` mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the Internet Computer, managing login/logout state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend interactions including user profile CRUD, CT scan upload/retrieval/analysis, and external API configuration management.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based CSS custom properties for light/dark themes including a medical-specific color palette.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page component with two tabs — 'All Scans' and 'Upload New' — for viewing CT scan results and uploading new scans.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH color tokens, custom border radii, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state metadata describing the CT scan AI analysis app's architecture, existing features, known issues (missing API config dialog), and pending feature requests."
}