{
  "backend/main.mo": "Main Motoko actor for the medical imaging application, handling user profiles, CT scan uploads, API configuration, and tumor detection analysis with role-based access control.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based CSS custom properties for light and dark theme color tokens including sidebar, chart, and UI component colors.",
  "frontend/index.html": "Minimal HTML entry point for the React app titled 'Medical Imaging Analysis Application' that mounts the app at the root div.",
  "frontend/src/App.tsx": "Root React component managing authentication state, profile loading, and conditional rendering of LoginScreen, ProfileSetup, or the main Dashboard with Header and Footer.",
  "frontend/src/components/ApiConfigDialog.tsx": "Admin-only dialog component for viewing and saving the external AI API endpoint URL and API key, with password masking for the key field.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying a medical disclaimer about AI-powered imaging analysis being for research and educational purposes.",
  "frontend/src/components/Header.tsx": "Sticky application header showing the MediScan AI brand, logged-in user profile info, an admin-only API Config button, and a logout button.",
  "frontend/src/components/LoginScreen.tsx": "Login page featuring the MediScan AI branding, three feature highlight cards, and an Internet Identity login button with loading state handling.",
  "frontend/src/components/ProfileSetup.tsx": "A form component that collects a user's name, department, and specialization, then saves the profile via the `useSaveCallerUserProfile` mutation hook.",
  "frontend/src/components/ScanCard.tsx": "Displays a summary card for a single CT scan, showing its image thumbnail, analysis status badge, and tumor detection result if analyzed.",
  "frontend/src/components/ScanDetailDialog.tsx": "A modal dialog that shows full CT scan details, supports triggering AI tumor analysis, and displays results including tumor stage and mask image in tabbed views.",
  "frontend/src/components/ScansListTab.tsx": "Renders a grid of ScanCard components for all uploaded scans, with loading/empty states and a detail dialog on card click.",
  "frontend/src/components/UploadScanTab.tsx": "Provides a form to upload a CT scan image with a patient ID, shows a preview of the selected file, and submits via the `useUploadScan` mutation hook.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, exposing login/logout functions, identity state, and login status via the DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, CT scans, and API configuration (endpoint/key) via the backend actor, with toast notifications for success/error states.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind base/components/utilities and defines CSS custom properties for light/dark theme colors including a medical-specific color palette using OKLCH.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page component with two tabs—'All Scans' and 'Upload New'—rendering ScansListTab and UploadScanTab respectively.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH-based color tokens (including medical and sidebar palettes), custom border radii, accordion animations, and typography/container-queries plugins.",
  "project_state.json": "Project state metadata describing three pending feature requests: restoring backend API config logic, restoring the frontend ApiConfigDialog and admin header button, and ensuring the Footer omits Caffeine AI branding."
}