{
  "kind": "build_request",
  "title": "API Configuration Dialog with Endpoint URL and API Key Inputs",
  "projectName": "MediScan AI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement an API Configuration modal dialog that allows admins to set the external AI API endpoint URL and API key. The dialog must include: a semi-transparent black modal overlay; a centered white dialog box with rounded corners (~500px wide); a bold 'API Configuration' title; a labeled text input for 'API Endpoint URL'; a labeled password input for 'API Key' with character masking; a 'Cancel' button with a gray outline style; and a 'Save' button with a solid blue style. The dialog should display inline validation errors for missing/invalid fields and show a loading state while saving.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "API Configuration Dialog",
          "Modal Overlay: Semi-transparent black backdrop",
          "Dialog Box: White, rounded corners, centered",
          "Width: ~500px",
          "Title: 'API Configuration' in bold",
          "Two input fields with labels: 'API Endpoint URL' (text input), 'API Key' (password input with masking)",
          "Buttons at bottom: Cancel (gray outline), Save (solid blue)"
        ]
      },
      "acceptanceCriteria": [
        "Modal overlay is semi-transparent black and covers the full screen when the dialog is open.",
        "Dialog box is centered, white, has rounded corners, and is approximately 500px wide.",
        "Title reads 'API Configuration' in bold.",
        "An 'API Endpoint URL' text input field is present with its label.",
        "An 'API Key' password input field is present with its label and masks the entered characters.",
        "A 'Cancel' button with gray outline styling closes the dialog without saving.",
        "A 'Save' button with solid blue styling submits the configuration.",
        "Inline validation errors are shown if endpoint URL or API key fields are empty or invalid.",
        "The Save button shows a loading/disabled state while the save operation is in progress.",
        "Previously saved values are pre-filled when the dialog is reopened.",
        "The dialog is only accessible to admin users."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the existing backend API configuration storage (endpoint URL and API key) correctly persists values saved from the new dialog and returns them when queried, so the dialog can pre-fill saved values on open.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "API Endpoint URL: The full URL where your AI model API is hosted",
          "API Key: Your authentication key from the AI service provider"
        ]
      },
      "acceptanceCriteria": [
        "Saving an API endpoint URL and API key via the dialog persists those values in the backend.",
        "Reopening the dialog pre-fills the previously saved endpoint URL and API key.",
        "Only admin users can read or write the API configuration."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "API key must never be exposed in plain text in the UI; use password-masked input.",
    "The dialog must only be accessible to confirmed admin users."
  ],
  "nonGoals": [
    "Adding new backend endpoints beyond what is needed for storing and retrieving API configuration.",
    "Implementing actual CT scan analysis logic or calling the external AI API directly from the dialog.",
    "Changing authentication or user profile management flows.",
    "Supporting non-admin users accessing the API configuration dialog."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}