{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix missing API Configuration dialog for CT scan analysis",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the API Configuration modal dialog is visible and accessible in the UI",
      "acceptanceCriteria": [
        "Admin users see an 'API Config' button in the header after logging in",
        "Clicking the button opens the API Configuration modal dialog",
        "The modal renders with a semi-transparent black backdrop overlay",
        "The dialog box is white, rounded, centered, approximately 500px wide"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Verify that the Header component correctly renders the 'API Config' button for admin users and that clicking it opens the ApiConfigDialog modal. Ensure the button is visible and properly wired to toggle the dialog state. The authorization component is used to check admin role status via useQueries hooks."
        },
        {
          "path": "frontend/src/components/ApiConfigDialog.tsx",
          "operation": "modify",
          "description": "Verify that the ApiConfigDialog modal renders correctly with a semi-transparent black backdrop overlay, a white rounded dialog box centered on screen at approximately 500px width, and that the open/close state is properly controlled by the parent Header component."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "The API Configuration dialog must contain proper form fields, validation, and pre-filled values",
      "acceptanceCriteria": [
        "Dialog title reads 'API Configuration' in bold",
        "An 'API Endpoint URL' labeled text input is present",
        "An 'API Key' labeled password input is present with characters masked",
        "Existing saved endpoint URL and API key are pre-filled when the dialog opens",
        "Cancel button has a gray outline style and closes the dialog without saving",
        "Save button has a solid blue style and persists the values to the backend",
        "Inline validation shows an error if the endpoint URL is empty or malformed before saving"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ApiConfigDialog.tsx",
          "operation": "modify",
          "description": "Verify that the dialog contains a bold 'API Configuration' title, an 'API Endpoint URL' text input field, an 'API Key' password input field with character masking, a gray outlined 'Cancel' button, and a solid blue 'Save' button. Ensure existing values from the backend are pre-filled using the useGetExternalApiConfig hook. Verify inline validation shows errors for empty or malformed endpoint URLs before saving. Verify the Cancel button closes the dialog without saving and the Save button persists values via the useConfigureExternalApi mutation."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Verify that useGetExternalApiConfig and useConfigureExternalApi hooks are properly implemented and working. Ensure useGetExternalApiConfig fetches the current ExternalApiConfig from the backend and useConfigureExternalApi mutation saves the new config. Verify proper error handling and success toast notifications are in place."
        }
      ]
    }
  ]
}