{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "CT scan analysis application with AI-powered tumor detection. Users need to configure an external AI API endpoint and key to receive analysis reports with tumor coordinates and stage information.",
  "architectural_notes": [
    "App connects to an external AI API for CT scan analysis; API must accept image uploads and return JSON with tumor coordinates and stage info",
    "CORS must be enabled on the external AI API to allow requests from the Internet Computer domain"
  ],
  "known_issues": [
    "API Configuration dialog (endpoint URL + API key input) is missing from the UI — users cannot currently configure their AI service connection"
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-ensure-the-api-configuration-modal-dialog-is-visible-and-accessible-in-the-ui-the-header-component-must-render-the-api-config-button-for-admin-users-and-clicking-it-must-open-the-apiconfigdialog-modal",
      "title": "Ensure the API Configuration modal dialog is visible and accessible in the UI. The Header component must render the 'API Config' button for admin users, and clicking it must open the ApiConfigDialog modal.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-the-api-configuration-dialog-must-contain-a-bold-api-configuration-title-an-api-endpoint-url-text-input-field-an-api-key-password-input-field-with-character-masking-a-gray-outlined-cancel-button-and-a-solid-blue-save-button-pre-fill-the-fields-with-any-existing-values-loaded-from-the-backend",
      "title": "The API Configuration dialog must contain: a bold 'API Configuration' title, an 'API Endpoint URL' text input field, an 'API Key' password input field with character masking, a gray outlined 'Cancel' button, and a solid blue 'Save' button. Pre-fill the fields with any existing values loaded from the backend.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "API Configuration dialog modal with fields for API Endpoint URL and API Key (password masked), plus Cancel and Save buttons, so users can connect to their external AI analysis service",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Ensure the backend actor exposes a stable API configuration endpoint that accepts and persists an API endpoint URL and API key, and returns them when queried. Verify the external API config getter and setter functions are correctly defined in main.mo and that the migration module handles the combined ExternalApiConfig record shape.",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "CT Scan Analysis",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}