{
  "backend/main.mo": "Main actor implementing CT scan upload, tumor analysis, user profile management, and API configuration (endpoint and key) with role-based access control and blob storage integration.",
  "backend/migration.mo": "Migration module that adds the apiKey field to the actor state, initializing it to an empty string for existing deployments.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features for API key management across frontend components (ApiConfigDialog, useQueries hooks, and ScanDetailDialog).",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their roles in authentication, profile management, scan upload/analysis, and API configuration with key support.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark theme variables for medical imaging application UI.",
  "frontend/index.html": "HTML entry point for the Medical Imaging Analysis Application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, profile setup, and dashboard rendering with loading states and theme provider integration.",
  "frontend/src/components/ApiConfigDialog.tsx": "Admin dialog component for configuring both AI API endpoint URL and API key with password-masked input and validation.",
  "frontend/src/components/Footer.tsx": "Footer component displaying attribution to caffeine.ai and medical disclaimer text.",
  "frontend/src/components/Header.tsx": "Application header with branding, user profile display, admin API configuration button, and logout functionality.",
  "frontend/src/components/LoginScreen.tsx": "Login screen component that displays the MediScan AI branding, feature highlights (AI-powered analysis, fast results, secure storage), and an Internet Identity login button with loading states.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form component that collects user information (name, department, specialization) and saves it using the useSaveCallerUserProfile hook with validation and loading states.",
  "frontend/src/components/ScanCard.tsx": "Card component that displays a CT scan thumbnail with metadata (scan ID, patient ID, analysis status) and visual indicators for whether tumor analysis has been completed.",
  "frontend/src/components/ScanDetailDialog.tsx": "Modal dialog that shows detailed CT scan information with tabs for original/mask images, displays analysis results (tumor detection, stage, confidence), and provides an analyze button with API configuration validation.",
  "frontend/src/components/ScansListTab.tsx": "Tab component that displays a grid of all CT scans using ScanCard components, handles empty states, and opens ScanDetailDialog when a scan is clicked.",
  "frontend/src/components/UploadScanTab.tsx": "Upload form component that allows users to select a CT scan image file and enter a patient ID, converts the file to Uint8Array, and uploads it using the useUploadScan hook with preview functionality.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializes access control with admin token, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, CT scan CRUD operations, scan analysis, and API configuration management with toast notifications and error handling.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes and medical-themed color palette using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrapping the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabbed interface for viewing all CT scans and uploading new scans with navigation between tabs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom colors using OKLCH, medical theme colors, container settings, animations, and typography plugins.",
  "project_state.json": "Project metadata tracking CT scan analysis application state, architectural notes about external AI API integration, known issues with API key configuration, and pending feature requests."
}